%% 运行这个文件

%% 加权矩阵（时间关系，我拿NSGA II随便优化了下（20次迭代，真的很随便了哈哈哈），没有仔细调参数，你可以自行再发挥）
% Q1=diag([2.746582033817953e+08,4.614331483211773e+12,8.337877196135220e+11]);     %平顺性优先
% Q1=diag([1.742597671085942e+07,5.451199558052420e+12,3.516729286910518e+12]);    %安全性和操纵稳定性优先
 Q1=diag([1.352113302819274e+08,4.935552230406874e+12,6.568941578861342e+12]);    %综合

%% 悬架系统参数 
% ms=400;
% 
% ks=20000;
% 
% c0=1200;
% 
% mu=40;
% 
% kt=200000;
ms = 1173;
mu = 152.1;
ks = 60000;
kt = 362000;
c0 = 2050;

%% 状态空间矩阵
% pa.A=[0 1 0 0;
%     -ks/ms -c0/ms ks/ms c0/ms;
%     0 0 0 1;
%     ks/mu c0/mu -(ks+kt)/mu -c0/mu];
% 
% pa.B=[0 1/ms 0 -1/mu]';
% pa.C=[-ks/ms -c0/ms ks/ms c0/ms;
%     1 0 -1 0;
%     0 0 1 0];
% 
% pa.D=[1/ms;
%     0;
%     0];
% 
% C=pa.C;
% D=pa.D;

[A,B,C,D] = set_Fun(0);

%% 目标函数里面的矩阵
Q=C'*Q1*C;
R=D'*Q1*D+1;
N=C'*Q1*D;

%% 计算状态反馈矩阵
[K,S,E]=lqr(A,B,Q,R,N);
K
% load_system("suspension.slx");
% 
% %% 运行模型仿真
% sim("suspension.slx");